{"cells":[{"cell_type":"markdown","metadata":{"id":"MH-3kVwvJYeP"},"source":["# 2.2 Типы данных. Идентификаторы и ключевые слова. Целочисленные типы и числа с плавающей запятой. Строки"]},{"cell_type":"markdown","metadata":{"id":"gMwyKhlQJ1mf"},"source":["## Задание 1"]},{"cell_type":"markdown","metadata":{"id":"Owu684lKKrjJ"},"source":["**Условие:**\n","Напишите функцию, получающую на вход целое положительное десятичное число и выводящую на экран его двоичное представление. Что выдаст функция при подаче на вход числа ```124124234```.\n","\n","**Формат ответа:**\n","Число в двоичном виде (например, ```0b10100001000101```)\n"]},{"cell_type":"markdown","metadata":{"id":"OCTvo3fHLaaJ"},"source":["**Решение:**"]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"f9_8IGndLeRO","executionInfo":{"status":"ok","timestamp":1707734326880,"user_tz":-300,"elapsed":2732,"user":{"displayName":"Дмитрий Шишнёв","userId":"05444202920278121809"}},"outputId":"0bab7f32-553a-46ab-b8b3-903404af297a"},"outputs":[{"output_type":"stream","name":"stdout","text":["124124234\n","0b111011001011111110001001010\n"]}],"source":["a = int(input())\n","def perevod(a):\n","    return bin(a)\n","print(perevod(a))\n"]},{"cell_type":"markdown","metadata":{"id":"g5S0h2-wKfGE"},"source":["## Задание 2"]},{"cell_type":"markdown","metadata":{"id":"orX7BUzcPKKf"},"source":["**Условие:**\n","Используя функции библиотеки ```math``` найдите значения синуса, косинуса и тангенса угла с градусной мерой ```75```. Округлите до 2х знаков после запятой.\n","\n","**Формат ответа:**\n","Кортеж (например, ```(0.23, 0.67, 0.56)```)\n"]},{"cell_type":"markdown","metadata":{"id":"ESSLfwqEPKKn"},"source":["**Решение:**"]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"y8HOlaNLPKKq","executionInfo":{"status":"ok","timestamp":1707734847894,"user_tz":-300,"elapsed":316,"user":{"displayName":"Дмитрий Шишнёв","userId":"05444202920278121809"}},"outputId":"68a51159-6669-403a-aa35-59bb0580e542"},"outputs":[{"output_type":"stream","name":"stdout","text":["(-0.39, 0.92, -0.42)\n"]}],"source":["from math import *\n","a = 75\n","def ugol(a):\n","    return round(sin(a), 2), round(cos(a), 2), round(tan(a), 2)\n","res = ugol(a)\n","print(tuple(ugol(a)))"]},{"cell_type":"markdown","metadata":{"id":"tq0Fcrg1KfXQ"},"source":["## Задание 3"]},{"cell_type":"markdown","metadata":{"id":"3xp-jyyHPMIb"},"source":["**Условие:**\n","С помощью операции среза выведите слово ```специалист``` из данного текста. В ответе укажите первый и последний индекс, который участвовал в срезе.\n","\n","**Формат ответа:**\n","Кортеж (например, ```(5,10)```)\n","\n"]},{"cell_type":"markdown","metadata":{"id":"H5ZlBsI2PMIi"},"source":["**Решение:**"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"6amsYUCoPMIn"},"outputs":[],"source":["text = \"Представим ситуацию: вы — специалист по информационной безопасности и знаете, что выстроенная вами защита — полная чушь. Возможно, вы этого и не знаете, но проверять особо не желаете, ведь кому хочется выходить из зоны комфорта и дополнительно что-то предпринимать, внедрять средства защиты, смягчать риски, отчитываться за бюджет?\""]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"2IsoWN0glMYv","executionInfo":{"status":"ok","timestamp":1707735594004,"user_tz":-300,"elapsed":4,"user":{"displayName":"Дмитрий Шишнёв","userId":"05444202920278121809"}},"outputId":"1d73aa93-4d0c-499c-fd6c-82c830c9f02c"},"outputs":[{"output_type":"stream","name":"stdout","text":["специалист\n","(26, 36)\n"]}],"source":["text = \"Представим ситуацию: вы — специалист по информационной безопасности и знаете, что выстроенная вами защита — полная чушь. Возможно, вы этого и не знаете, но проверять особо не желаете, ведь кому хочется выходить из зоны комфорта и дополнительно что-то предпринимать, внедрять средства защиты, смягчать риски, отчитываться за бюджет?\"\n","\n","print(text[26:36])\n","diapazon = 26,36\n","print(tuple(diapazon))\n"]}],"metadata":{"colab":{"provenance":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.11.7"},"toc":{"base_numbering":1,"nav_menu":{},"number_sections":true,"sideBar":true,"skip_h1_title":false,"title_cell":"Table of Contents","title_sidebar":"Contents","toc_cell":false,"toc_position":{},"toc_section_display":true,"toc_window_display":false}},"nbformat":4,"nbformat_minor":0}