{"cells":[{"cell_type":"markdown","metadata":{"id":"MH-3kVwvJYeP"},"source":["\n","# 2.9.1 Математические вычисления и числа, типы коллекций"]},{"cell_type":"markdown","metadata":{"id":"gMwyKhlQJ1mf"},"source":["## Задание 1"]},{"cell_type":"markdown","metadata":{"id":"Owu684lKKrjJ"},"source":["**Условие:**\n","\n","Напишите функцию, которая случайно переставляет буквы во введенном слове.\n"]},{"cell_type":"markdown","metadata":{"id":"4pRrk83g0Ssr"},"source":["**Решение:**"]},{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"oN1WChO60Sss","executionInfo":{"status":"ok","timestamp":1709410723644,"user_tz":-300,"elapsed":4758,"user":{"displayName":"Дмитрий Шишнёв","userId":"05444202920278121809"}},"outputId":"26c50ed1-9c52-4ab0-c307-07a5ba10844c"},"outputs":[{"output_type":"stream","name":"stdout","text":["Введите слово: привет\n","Переставленное слово: твпеир\n"]}],"source":["import random\n","\n","def shuffle_word(word):\n","    # Преобразуем строку в список символов\n","    letters = list(word)\n","    # Перемешиваем буквы\n","    random.shuffle(letters)\n","    # Соединяем перемешанные буквы в одно слово\n","    shuffled_word = ''.join(letters)\n","    return shuffled_word\n","\n","# Пример использования функции\n","word = input(\"Введите слово: \")\n","shuffled_word = shuffle_word(word)\n","print(\"Переставленное слово:\", shuffled_word)\n"]},{"cell_type":"markdown","metadata":{"id":"g5S0h2-wKfGE"},"source":["## Задание 2"]},{"cell_type":"markdown","metadata":{"id":"orX7BUzcPKKf"},"source":["**Условие:**\n","Используя методы модуля ```math```, найти значения $e^{\\pi}$ и $\\pi^{e}$. В случае, если первое выражение больше,то в ответе укажите 1, иначе - 0.\n","\n","**Формат ответа:**\n","Число (например, ```1```)"]},{"cell_type":"markdown","metadata":{"id":"ESSLfwqEPKKn"},"source":["**Решение:**"]},{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"y8HOlaNLPKKq","executionInfo":{"status":"ok","timestamp":1709410749478,"user_tz":-300,"elapsed":311,"user":{"displayName":"Дмитрий Шишнёв","userId":"05444202920278121809"}},"outputId":"d3b4ffbc-63e9-41de-e763-ba20e69cd93f"},"outputs":[{"output_type":"stream","name":"stdout","text":["1\n"]}],"source":["import math\n","\n","# Находим значения выражений\n","exp1 = math.exp(math.pi)\n","exp2 = math.pi * math.e\n","\n","# Сравниваем значения и возвращаем результат\n","if exp1 > exp2:\n","    result = 1\n","else:\n","    result = 0\n","\n","print(result)\n"]}],"metadata":{"colab":{"provenance":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.11.7"}},"nbformat":4,"nbformat_minor":0}